# Запрос ИНН от пользователя
inn = input("Введите ИНН (12 цифр): ")

if len(inn) != 12 or not inn.isdigit():
    print("Некорректный ИНН. Он должен состоять из 12 цифр.")
else:
    n = [int(d) for d in inn]

    # Расчет контрольных цифр
    n11 = (7 * n[0] + 2 * n[1] + 4 * n[2] + 10 * n[3] + 3 * n[4] +
            5 * n[5] + 9 * n[6] + 4 * n[7] + 6 * n[8] + 8 * n[9]) % 11 % 10

    n12 = (3 * n[0] + 7 * n[1] + 2 * n[2] + 4 * n[3] + 10 * n[4] +
            3 * n[5] + 5 * n[6] + 9 * n[7] + 4 * n[8] + 6 * n[9] + 8 * n11) % 11 % 10

    # Проверка контрольных цифр
    if (n11, n12) == (int(inn[10]), int(inn[11])):
        print("ИНН корректен.")
        print(f"Код субъекта РФ: {inn[:2]}")
        print(f"Номер МНИ: {inn[2:4]}")
        print(f"Номер записи: {inn[4:10]}")
        print(f"1 контрольное число: {inn[10]}")
        print(f"2 контрольное число: {inn[11]}")
    else:
        print("Некорректный ИНН. Контрольные числа не совпадают.")
